#+TAGS: ignore(i) noexport(n)
#+PROPERTY: header-args :eval never-export
#+OPTIONS:   H:5 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc

#+LaTeX: \newcounter{result}
#+LaTeX: \newenvironment{result}{\begin{boxedminipage}{\linewidth}\textit{\refstepcounter{result}\uline{Action \#\arabic{result}:}}\bf}{\end{boxedminipage}}
#+LaTeX: \let\leq=\leqslant
#+LaTeX: \let\geq=\geqslant


This paper reports the successful reproduction of the results in the
article \cite{velho:inria-00361031} entitled /Accuracy Study and
Improvement of Network Simulation in the SimGrid Framework/, which has
been published at the SimuTools 2009 conference. We detail several
pitfalls we stumbled upon during this reproduction process and report
the actions we took to improve the reproducibility of this work.

The first action we took is related to the visibility and availability
of the original article. Open access was not mandated by the funders of this
research at the time of publication. Even worse, we were regularly
told about constraining copyright issues from the editors and
discouraged to make our articles publicly available. Only the
bibliography entry was available on HAL and not the PDF. Yet the preprint was hosted
on the webpage of [[http://mescal.imag.fr/membres/pedro.velho/publications.html][both]] [[http://mescal.imag.fr/membres/arnaud.legrand/articles/simutools09.pdf][authors]] and visible mostly through the [[https://simgrid.org/publications.html][SimGrid
publication webpage]].

#+LaTeX: \begin{result} 
 The PDF version of the original article has thus been uploaded on
 [[https://hal.inria.fr/inria-00361031][HAL]] when engaging in the replication process.
#+LaTeX: \end{result}

** Rebuilding the software environment
SimGrid is mostly a C library whose software dependencies had at that
time been kept to the bare minimum (C and C++ compiler). Furthermore,
we are developers of the SimGrid library so building it was rather
straightforward even on a recent Linux distribution. 
However, after trying to compile GTNetS, we quickly realized
it depends on the Qt3 GUI Library whereas the version which is now
commonly found is Qt5! Therefore, we decided to recreate a minimal
software environment as close as possible to the one of 2008. 

The code name for the stable Debian distribution at that time was
/Lenny/ Debian provides two particularly interesting tools to reproduce
"old" environments:
1. The [[https://snapshot.debian.org/][Debian snapshot archive]] is a wayback machine that allows access to
   old packages based on dates and version numbers. It consists of all
   past and current packages the Debian distribution ever provided.
2. The [[https://github.com/debuerreotype/debuerreotype][Debuerreotype]] is a reproducible, snapshot-based Debian rootfs
   builder. It allows to prepare old Debian images from the
   snapshot archive, which is particularly useful to prepare Docker
   images containing old software environments.

Both authors regularly used =testing= so after investigating a bit
on the snapshot archive which versions of the libraries were available
and when they have been introduced, we decided to try to bootstrap a
debian Lenny from the 1st of May 2009 with the following command:
#+LaTeX: \bgroup\footnotesize
#+begin_src shell :session *shell* :results output :exports both
debuerreotype-init --keyring=/usr/share/keyrings/debian-archive-removed-keys.gpg \
   rootfs testing 2009-05-01-T03:27:08Z
#+end_src
#+LaTeX: \egroup
Building such an image involves installing (with =dpkg=) old packages in
a sub-directory pretending you are root. The =keyring= argument passed to
=debuerreotype-init= allows to indicate =dpkg= that it is safe to install
these old packages even if they have been signed by package
maintainers which are currently not active anymore. Unfortunately,
although this approach worked like a charm for more recent target
#+LaTeX: dates (e.g., \texttt{2015-06-04-\discretionary{}{}{}T10:47:50Z}), 
it miserably fails with a "Segmentation fault" when installing
=base-passwd:=
#+LaTeX: \bgroup\footnotesize
#+BEGIN_EXAMPLE
W: Failure trying to run: chroot "/home/alegrand/Work/Documents/Articles/2020/
        reproducibility_challenge/simgrid3.3_gtnets/rootfs" dpkg --force-depends 
             --install /var/cache/apt/archives/base-passwd_3.5.21_amd64.deb
W: See /home/alegrand/Work/Documents/Articles/2020/reproducibility_challenge/
         simgrid3.3_gtnets/rootfs/debootstrap/debootstrap.log for details

error: 'debootstrap' failed!
#+END_EXAMPLE
#+LaTeX: \egroup

We then decided to cry for help and asked two Debian guru friends,
Vincent Danjean and Samuel Thibault. Samuel Thibault indicated us that
he had investigated this by using the simpler following command:
#+LaTeX: \bgroup\footnotesize
#+begin_src shell :results output :exports both
  debootstrap wheezy myroot http://archive.debian.org/debian/
#+end_src
#+LaTeX: \egroup
and that the error message was then slightly more visible
#+LaTeX: \bgroup\footnotesize
  #+BEGIN_EXAMPLE
  dpkg: warning: parsing file '/var/lib/dpkg/status' near line 5 package 'dpkg':
   missing description
  
  Package: dpkg
  Status: install ok installed
  Maintainer: unknown
  Version: 1.16.18
  #+END_EXAMPLE
#+LaTeX: \egroup
The problem actually comes from =dpkg=. When bootstraping such an image,
we try to use old debian packages with a recent =dpkg= (the one running
on our machine) so it is not surprising that it may break. Although it
is not the case, the internal format of Debian packages could have evolved and may not
be supported anymore with recent versions of =dpkg=. Likewise, it is
somehow a matter of luck that an old binary still works with a recent
kernel... Indeed, when using docker or similar container-based
approach, we only divert syscalls so if the ABI of the Linux kernel
had changed in the meantime, binary codes would simply fail to
run. Fortunately, such changes are quite rare and the Linux/Debian
community is making incredible efforts to provide super stable
backward compatible software so what could be the reason behind this
failure?

Surprisingly Vincent Danjean reported me that the command worked like
a charm for him, which means some local configuration from
his machine could change this behavior. We could actually track back
the problem to an ABI modification of the kernel. As explained for
example on the [[https://einsteinathome.org/content/vsyscall-now-disabled-latest-linux-distros][Einstein@Home forum]], \bgroup\em"On latest Linux distros, =vsyscall=
is defaulted to none for security reasons. However, this breaks some
very old binaries, including some binaries from this project that are
statically-linked against ancient versions of =glibc="\egroup. Vincent had
activated this flag a long time ago to run some old proprietary code.
Booting the machine while adding ~vsyscall=emulate~ to the kernel
command line solved the problem and allows ~debuerreotype~ to build the
desired =rootfs=.

Since this is a bit far-fetched, we decided to trade precision for
simplicity by checking whether ready-to-use Docker images were
available on the Docker Hub, [[https://hub.docker.com/r/lpenz/debian-lenny-i386/][which is the case]].
#+begin_src shell :results output :exports both
docker search debian-lenny
#+end_src

#+RESULTS:
: NAME                               DESCRIPTION                                     STARS
: pblaszczyk/debian-lenny            5.0.10 amd64                                    3                                       
: lpenz/debian-lenny-amd64           Debian 5.0.10 Released 10 March 2012 for amd…   1                                       
: lpenz/debian-lenny-i386            Debian 5.0.10 Released 10 March 2012 for i386   1                                       
: lpenz/debian-lenny-amd64-minbase   Debian 5.0.10 Released 10 March 2012 for amd…   0                                       
: ...

Note that the first version of Lenny (5.0.0) was introduced in
February 2009 whereas the one easily found on the DockerHub is the
last version (5.0.10) which dates from March 2012. The main
differences are related to security updates and should be of not
importance for our concern. We arbitrarily chose the
=lpenz/debian-lenny-i386= one but according to the instructions of
Figure \ref{fig:README2} =lpenz/debian-lenny-amd64= should have worked
as well. After playing a bit interactively in this Docker image
trying to install everything we needed to build GTNetS and SimGrid,
and following the patching and compiling instructions, we ended up
with the =Dockerfile= presented in Figure \ref{fig:dockerfile}. 
The image can be simply built with the following command:
#+begin_src shell :results output :exports both
docker build -t alegrand/simgrid3_3_gtnets simgrid3.3_gtnets
#+end_src

   #+BEGIN_EXPORT latex
   \begin{figure}[!thb]
     \centering
     \VerbatimInput[label=\fbox{\color{black}simutools09/simgrid3.3\_gtnets/Dockerfile}]{simutools09/simgrid3.3_gtnets/Dockerfile}
     \caption{The Dockerfile recipe which allows to build both GTNetS and Simgrid}
     \label{fig:dockerfile}
   \end{figure}
   #+END_EXPORT

#+LaTeX: \begin{result} 
  We have now proposed a simple and automated way to build a minimalist environment
  comprising the simulation code used in the original article. This
  =Dockerfile= recipe has been made available in the [[https://github.com/alegrand/reproducibility-challenge/tree/master/simutools09/simgrid3.3_gtnets/][GitHub repository
  attached to this Rescience submission]]. The resulting docker image
  has been made available on the [[https://hub.docker.com/repository/docker/alegrand38/simgrid3_3_gtnets][DockerHub]]. It can be recovered using:\rm
  #+begin_src shell :results output :exports both
  docker pull alegrand38/simgrid3_3_gtnets
  #+end_src
#+LaTeX: \end{result}

Note that, as such, this =Dockerfile= is still a bit fragile as it
depends on a third party base image (=lpenz/debian-lenny-i386=) and
downloads the code from =gforge.inria.fr=. Ideally, it would be improved
to build on my own =debuerreotype= image for a specific date and to
download the code from [[https://www.softwareheritage.org/][software heritage]]. We propose to leave this for
the next reproducibility challenge in a decade or so.

** Expectations
   Following the information from the README of each series of
   simulations (see Figure \ref{fig:README4}), we could easily
   determine which scripts to run (=sweep-parse.pl=). It is interesting
   to note that the logs of each simulation were stored in the archive
   (in =log/=) as well as the parsing of these logs (in =dat/=).

Before trying to rerun all this, we ensured a specific parameter
combination could be run to manually check whether outputs are matching
or not. Here was the target:

#+begin_src shell :results output :exports both
head -4 simutools09/instructions/01-onelink/dat/raw.data
#+end_src

#+RESULTS:
: Bandwidth Latency Size Model Time
: 1 1.000000e+05 0.00001 1000 CM02 0.010010
: 2 1.000000e+05 0.00001 1000 GTNets 0.013140
: 3 1.000000e+05 0.00001 1000 LegrandVelho 0.010974

And here was the output we should get from running =gtnets=.\label{expected-output}
#+begin_src shell :results output :exports both
head -46 simutools09/instructions/01-onelink/log/trace-file-1-1.log
#+end_src

#+RESULTS:
#+begin_example
>==================================================<
========> Bandwidth (B) : 1.000000e+05 B/s (Bytes per second)
========> Latency   (L) : 0.00001 s (seconds)
========> Size      (S) : 1000 B (Bytes) 
========> Model     (M) : CM02
[0.000000] [simix_kernel/INFO] setting 'workstation_model' to 'compound'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[0.000000] [simix_kernel/INFO] setting 'cpu_model' to 'Cas01'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[0.000000] [simix_kernel/INFO] setting 'network_model' to 'CM02'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[S1:master:(1) 0.010010] [msg_test/INFO] Send completed (to C1). Transfer time: 0.010010
	 Agregate bandwidth: 99900.099900
[S1:master:(1) 0.010010] [msg_test/INFO] Completed peer: C1 time: 0.010010
[C1:slave:(2) 0.010010] [msg_test/INFO] ===> Estimated Bw of FLOW[1] : 99900.099900 ;
  message from S1 to C1  with remaining : 0.000000
=========================><=========================
>==================================================<
========> Bandwidth (B) : 1.000000e+05 B/s (Bytes per second)
========> Latency   (L) : 0.00001 s (seconds)
========> Size      (S) : 1000 B (Bytes) 
========> Model     (M) : GTNets
[0.000000] [simix_kernel/INFO] setting 'workstation_model' to 'compound'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[0.000000] [simix_kernel/INFO] setting 'cpu_model' to 'Cas01'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[0.000000] [simix_kernel/INFO] setting 'network_model' to 'GTNets'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[S1:master:(1) 0.013140] [msg_test/INFO] Send completed (to C1). Transfer time: 0.013140
	 Agregate bandwidth: 76103.500761
[S1:master:(1) 0.013140] [msg_test/INFO] Completed peer: C1 time: 0.013140
[C1:slave:(2) 0.013140] [msg_test/INFO] ===> Estimated Bw of FLOW[1] : 76103.500761 ;
  message from S1 to C1  with remaining : 0.000000
=========================><=========================
>==================================================<
========> Bandwidth (B) : 1.000000e+05 B/s (Bytes per second)
========> Latency   (L) : 0.00001 s (seconds)
========> Size      (S) : 1000 B (Bytes) 
========> Model     (M) : LegrandVelho
[0.000000] [simix_kernel/INFO] setting 'workstation_model' to 'compound'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[0.000000] [simix_kernel/INFO] setting 'cpu_model' to 'Cas01'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[0.000000] [simix_kernel/INFO] setting 'network_model' to 'LegrandVelho'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[S1:master:(1) 0.010974] [msg_test/INFO] Send completed (to C1). Transfer time: 0.010974
	 Agregate bandwidth: 91128.086469
[S1:master:(1) 0.010974] [msg_test/INFO] Completed peer: C1 time: 0.010974
[C1:slave:(2) 0.010974] [msg_test/INFO] ===> Estimated Bw of FLOW[1] : 91128.086469 ;
  message from S1 to C1  with remaining : 0.000000
=========================><=========================
#+end_example

** Running the simulation in the Docker image
As the reader may have noted, the Docker image we produced only
contains the binary code of the simulator but not the input files nor
the perl script to run simulations. This is an intended separations of
concerns and we believe it is a good practice to keep images as
lightweight as possible and easier to maintain. We now describe how
to rerun the simulation. We should first run the docker
container.
#+begin_src shell :session *shell* :results output :exports both 
docker run -ti alegrand38/simgrid3_3_gtnets
#+end_src
# #+begin_src shell :session *shell* :results output :exports both 
# mkdir -p /root/simutools09/01-onelink
# #+end_src
Then the template XML input files should be copied within the container (=$CONTAINER=
corresponds to the container id of the container and is obtained
either using =docker ps= or by querying the =hostname= within the
container).
#  :var CONTAINER=container
#+begin_src shell :results output :exports both
docker cp simutools09/instructions/01-onelink/onelink-d-template.xml \
       $CONTAINER:/root/simutools09/01-onelink
docker cp simutools09/instructions/01-onelink/onelink-p-template.xml \
       $CONTAINER:/root/simutools09/01-onelink
#+end_src
It is then possible to substitute the target parameters in these XML
files and to run the simulation in the container:
#+begin_src shell :session *shell* :results output :exports both 
cd /root/simutools09/01-onelink
sed -e s/bw/1.000000e+05/g -e s/lt/0.00001/g onelink-p-template.xml \
    > /tmp/onelink-p.xml
sed -e s/size/1000/g onelink-d-template.xml > /tmp/onelink-d.xml
for model in CM02 GTNets LegrandVelho; do
    echo ">==================================================<"
    echo "========> Model     (M) : $model"
    /root/simgrid-3.3/examples/msg/gtnets/gtnets              \
       /tmp/onelink-p.xml  /tmp/onelink-d.xml                 \
       --cfg=workstation_model:compound --cfg=cpu_model:Cas01 \ 
       --cfg=network_model:$model;
done;
#+end_src

#+RESULTS:
#+begin_example
>==================================================<
========> Model     (M) : CM02
echo 'org_babel_sh_eoe'
echo 'org_babel_sh_eoe'
[0.000000] [simix_kernel/INFO] setting 'workstation_model' to 'compound'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[0.000000] [simix_kernel/INFO] setting 'cpu_model' to 'Cas01'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[0.000000] [simix_kernel/INFO] setting 'network_model' to 'CM02'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[S1:master:(1) 0.010010] [msg_test/INFO] Send completed (to C1). Transfer time: 0.010010
	 Agregate bandwidth: 99900.099900
[S1:master:(1) 0.010010] [msg_test/INFO] Completed peer: C1 time: 0.010010
[C1:slave:(2) 0.010010] [msg_test/INFO] ===> Estimated Bw of FLOW[1] : 99900.099900 ;
  message from S1 to C1  with remaining : 0.000000
>==================================================<
========> Model     (M) : GTNets
[0.000000] [simix_kernel/INFO] setting 'workstation_model' to 'compound'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[0.000000] [simix_kernel/INFO] setting 'cpu_model' to 'Cas01'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[0.000000] [simix_kernel/INFO] setting 'network_model' to 'GTNets'
[0.000000] [xbt_cfg/INFO] type in variable = 2
<<<<<================================>>>>>
Dumping GTNETS topollogy information
== LINKID: 0
  [SRC] ID: 0, router?: 0, hosts[]: [ 0]
  [DST] ID: 1, router?: 0, hosts[]: [ 1]
>>>>>================================<<<<<
[S1:master:(1) 0.013140] [msg_test/INFO] Send completed (to C1). Transfer time: 0.013140
	 Agregate bandwidth: 76103.500761
[S1:master:(1) 0.013140] [msg_test/INFO] Completed peer: C1 time: 0.013140
[C1:slave:(2) 0.013140] [msg_test/INFO] ===> Estimated Bw of FLOW[1] : 76103.500761 ;
  message from S1 to C1  with remaining : 0.000000
>==================================================<
========> Model     (M) : LegrandVelho
[0.000000] [simix_kernel/INFO] setting 'workstation_model' to 'compound'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[0.000000] [simix_kernel/INFO] setting 'cpu_model' to 'Cas01'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[0.000000] [simix_kernel/INFO] setting 'network_model' to 'LegrandVelho'
[0.000000] [xbt_cfg/INFO] type in variable = 2
[S1:master:(1) 0.010974] [msg_test/INFO] Send completed (to C1). Transfer time: 0.010974
	 Agregate bandwidth: 91128.086469
[S1:master:(1) 0.010974] [msg_test/INFO] Completed peer: C1 time: 0.010974
[C1:slave:(2) 0.010974] [msg_test/INFO] ===> Estimated Bw of FLOW[1] : 91128.086469 ;
  message from S1 to C1  with remaining : 0.000000
#+end_example
We could thus recover exactly the expected values which are reported on page \pageref{expected-output}.

** Replicating the first series of simulations
Using the perl script should thus allow to re-execute the
simulation. It comprises hard-coded absolute paths and
a quick minor modification had thus to be made. Here is how to proceed:
- Within the container, we first create the directories that will
  host the simulation results:
  #+begin_src shell :session *shell* :results output :exports both 
  mkdir -p /root/simutools09/01-onelink/bin
  mkdir -p /root/simutools09/01-onelink/dat
  mkdir -p /root/simutools09/01-onelink/log
  mkdir -p /root/simutools09/01-onelink/tmp
  #+end_src
- Then outside the container, we copy the template input files and
  simulation perl script:
  # :var CONTAINER=container
  #+begin_src shell :results output :exports both
  docker cp simutools09/instructions/01-onelink/onelink-d-template.xml \
	 $CONTAINER:/root/simutools09/01-onelink
  docker cp simutools09/instructions/01-onelink/onelink-p-template.xml \
	 $CONTAINER:/root/simutools09/01-onelink
  docker cp simutools09/instructions/01-onelink/bin/sweep-parse.pl \
	 $CONTAINER:/root/simutools09/01-onelink/bin/sweep-parse.pl
  #+end_src
- And finally back inside the container, we fix the absolute paths
  before running the simulations:
#   sed -i 's|/home/velho/Development/projet-simgrid/simgrid/examples/msg/gtnets|/root/simgrid-3.3/examples/msg/gtnets|g' \
#        /root/simutools09/01-onelink/bin/sweep-parse.pl
  #+begin_src shell :session *shell* :results output :exports both 
  old_path="/home/velho/Development/projet-simgrid/simgrid/examples/msg/gtnets"
  new_path="/root/simgrid-3.3/examples/msg/gtnets"
  sed -i "s|$old_path|$new_path|g" /root/simutools09/01-onelink/bin/sweep-parse.pl
  cd /root/simutools09/01-onelink/
  ./bin/sweep-parse.pl sweep 1 1
  #+end_src

  #+RESULTS:
  : Bandiwthd array size is : 43
  : Changing working directory to /root/simgrid-3.3/examples/msg/gtnets
  : =============================================================<
  : Bandwidth (B) : 1.000000e+05 B/s (Bytes per second)
  : Latency   (L) : 0.00001 s (seconds)
  : Size      (S) : 1000 B (Bytes)
  : ...

  This worked like a charm! Unfortunately, according to the script,
  there are $40\times15= 600$ (latency, bw) combinations, which run each
  for a bit more than a minute, hence about 10 hours solely for the
  first series of experiments. We did not let it run to the end but we
  checked that the parsing works and that all results matched for a
  hundred of combinations.

** Running the analysis of the first series of experiments.
The analysis depends on master R script
(=simutools09/instructions/01-onelink/analyze.R=) which invokes perl and
gnuplot. This is ugly but all pretty standard so we decided there was
no need to rebuild a dedicated analysis environment and that it should
run directly on our machine. To avoid messing up with the content of the
original data, we decided to work in the =/tmp= of our machine as
follows:

# :var CONTAINER=container
#+begin_src shell :results output :exports both 
mkdir -p /tmp/simutools09/01-onelink/dat/
mkdir -p /tmp/simutools09/01-onelink/log/
mkdir -p /tmp/simutools09/01-onelink/tmp/
mkdir -p /tmp/simutools09/01-onelink/bin/
docker cp $CONTAINER:/root/simutools09/01-onelink/dat/raw.data /tmp/simutools09/01-onelink/dat/
cp simutools09/instructions/01-onelink/analyze.R /tmp/simutools09/01-onelink/
cp simutools09/instructions/01-onelink/bin/* /tmp/simutools09/01-onelink/bin/
#+end_src

#+begin_src R :results output :session *R* :exports both :dir /tmp/simutools09/01-onelink/
source("analyze.R");
#+end_src

#+RESULTS:
#+begin_example
# Latency (SECONDS) Size (BYTES) Time (SECONDS) 
Relax this may take some time
...........................................................
...........................................................
...........................................................
..................................................
Cadidates are X=0.934752791154703 and Y=10.6510810055123
The min is approximatelly: 0.0466609377572045
[1] "Hello!!!"
-Inf & NaN & NA \\ 
-Inf & NaN & NA \\ 
-Inf & NaN & NA \\ 
-Inf & NaN & NA \\ 
-Inf & NaN & NA \\ 
-Inf & NaN & NA \\ 
9.524 87.72 490.2 905.8 989.7   999 999.9-Inf & NaN & NA \\ 
-Inf & NaN & NA \\ 
-Inf & NaN & NA \\ 
-Inf & NaN & NA \\ 
"./tmp/gnuplotError.script" line 4: undefined variable: Inf

"./tmp/gnuplotError.script" line 4: undefined variable: Inf

There were 15 warnings (use warnings() to see them)
#+end_example

When running, a gnuplot window with a 3D graph popped up. There are
error messages but the "~Cadidates are X=0.934752791154703 and
Y=10.6510810055123~" message is really nice as these are the latency
and bandwidth modifiers obtained through a custom linear regression
and this is very familiar. The original paper reports ~.92~ and ~10.4~
(page 5). The warnings and the differences come from the fact that the regression we
just run was done using a smaller set of simulations because we didn't
want to waste our time rerunning all the simulations.

